In [ ]:
print('hi')

[GOOGLE](https://google.com)

텍스트

In [1]:
import pandas as pd
import numpy as np

In [ ]:
print(pd.__version__)

In [ ]:
a=1
b=2

In [ ]:
print(a)
print(b)

In [ ]:
a

In [ ]:
b

### 시리즈

- 같은 종류의 데이터 집합, 컬럼단위

In [2]:
pd.Series([1,3,5,np.nan,6,8])

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
pd.Series([1,3,5,7,6,8])

0    1
1    3
2    5
3    7
4    6
5    8
dtype: int64

In [4]:
pd.Series([1,3,5,7,6,8],dtype="float32")

0    1.0
1    3.0
2    5.0
3    7.0
4    6.0
5    8.0
dtype: float32

In [5]:
pd.Series([1,3,'5',7,6,8])

0    1
1    3
2    5
3    7
4    6
5    8
dtype: object

In [7]:
dates = pd.date_range("20130101",periods=6)

In [8]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [34]:
df = pd.DataFrame(np.random.randn(6,4),
             index=dates,
             columns=list("ABCD"))

In [ ]:
# list("ABCD")

In [11]:
pd.DataFrame(np.random.randn(6,4))

          0         1         2         3
0 -1.004535  0.717095 -0.558807  0.471793
1  2.703583 -1.811175  0.095970 -1.549737
2 -0.306544 -1.263720 -1.309369 -0.955536
3 -0.748364 -0.100322 -0.039750 -0.860151
4  0.085236  0.479573 -1.229663 -0.650500
5  0.162293  1.662694 -0.801124  1.081939

In [14]:
df2 = pd.DataFrame(
    {
       "A":0.1,
       "B":pd.Timestamp("20130102"),
       "C":pd.Series(1,index=list(range(4)),dtype="float32"),
       "D":np.array([3]*4,dtype="int32"),
       "E":pd.Categorical(["test", "train","text","train"]),
       "F":"foo"
    }
)

In [15]:
type(df2)

pandas.core.frame.DataFrame

In [16]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [17]:
df2.shape

(4, 6)

In [18]:
df2.ndim

2

In [19]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 296.0+ bytes

In [20]:
df2.head(2)

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo

In [21]:
df2.tail(2)

     A          B    C  D      E    F
2  0.1 2013-01-02  1.0  3   text  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [23]:
df2.sample(2)

     A          B    C  D      E    F
3  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   text  foo

In [24]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [25]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [26]:
df2.values

array([[0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'text', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [29]:
type(df2.index)

pandas.core.indexes.numeric.Int64Index

In [30]:
type(df2.columns)

pandas.core.indexes.base.Index

In [31]:
type(df2.values)

numpy.ndarray

In [32]:
df2.to_numpy()

array([[0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'text', 'foo'],
       [0.1, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [33]:
df2

     A          B    C  D      E    F
0  0.1 2013-01-02  1.0  3   test  foo
1  0.1 2013-01-02  1.0  3  train  foo
2  0.1 2013-01-02  1.0  3   text  foo
3  0.1 2013-01-02  1.0  3  train  foo

In [35]:
df

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-04 -0.728997  0.950293 -0.004287  0.624739
2013-01-05 -0.655220 -0.328018  0.004137  1.078173
2013-01-06 -0.575533 -1.402827 -0.060562 -0.557574

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [37]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.537663 -0.216581 -0.338670  0.149855
std    0.683662  0.912164  0.587429  0.620401
min   -1.613425 -1.402827 -1.466987 -0.557574
25%   -0.710553 -0.928036 -0.395935 -0.296430
50%   -0.615377 -0.036982 -0.032424  0.053200
75%   -0.194356  0.329802  0.001480  0.527127
max    0.414492  0.950293  0.004137  1.078173

In [38]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   0.1  1.0  3.0
std    0.0  0.0  0.0
min    0.1  1.0  3.0
25%    0.1  1.0  3.0
50%    0.1  1.0  3.0
75%    0.1  1.0  3.0
max    0.1  1.0  3.0

In [39]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.067297    0.414492   -1.613425   -0.728997   -0.655220   -0.575533
B    0.254055    0.355051   -1.128042    0.950293   -0.328018   -1.402827
C   -1.466987    0.003403   -0.507726   -0.004287    0.004137   -0.060562
D   -0.127889   -0.352610    0.234290    0.624739    1.078173   -0.557574

In [40]:
df.transpose()

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.067297    0.414492   -1.613425   -0.728997   -0.655220   -0.575533
B    0.254055    0.355051   -1.128042    0.950293   -0.328018   -1.402827
C   -1.466987    0.003403   -0.507726   -0.004287    0.004137   -0.060562
D   -0.127889   -0.352610    0.234290    0.624739    1.078173   -0.557574

In [43]:
df.sort_index(ascending=False)

                   A         B         C         D
2013-01-06 -0.575533 -1.402827 -0.060562 -0.557574
2013-01-05 -0.655220 -0.328018  0.004137  1.078173
2013-01-04 -0.728997  0.950293 -0.004287  0.624739
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889

In [44]:
df.sort_index(ascending=False, axis=1)

                   D         C         B         A
2013-01-01 -0.127889 -1.466987  0.254055 -0.067297
2013-01-02 -0.352610  0.003403  0.355051  0.414492
2013-01-03  0.234290 -0.507726 -1.128042 -1.613425
2013-01-04  0.624739 -0.004287  0.950293 -0.728997
2013-01-05  1.078173  0.004137 -0.328018 -0.655220
2013-01-06 -0.557574 -0.060562 -1.402827 -0.575533

In [47]:
df.sort_values(by=["A","B"],ascending=False)

                   A         B         C         D
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-06 -0.575533 -1.402827 -0.060562 -0.557574
2013-01-05 -0.655220 -0.328018  0.004137  1.078173
2013-01-04 -0.728997  0.950293 -0.004287  0.624739
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290

In [48]:
df['A']

2013-01-01   -0.067297
2013-01-02    0.414492
2013-01-03   -1.613425
2013-01-04   -0.728997
2013-01-05   -0.655220
2013-01-06   -0.575533
Freq: D, Name: A, dtype: float64

In [49]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290

In [50]:
df['2013-01-01':'2013-01-04']

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-04 -0.728997  0.950293 -0.004287  0.624739

df.loc[label] 컬럼, 인덱스 이름 그대로 사용
df.iloc[position] 인덱스

In [51]:
df

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-04 -0.728997  0.950293 -0.004287  0.624739
2013-01-05 -0.655220 -0.328018  0.004137  1.078173
2013-01-06 -0.575533 -1.402827 -0.060562 -0.557574

In [52]:
df.loc['2013-01-03':'2013-01-04',['B','C']]

                   B         C
2013-01-03 -1.128042 -0.507726
2013-01-04  0.950293 -0.004287

In [53]:
df.loc['2013-01-03':'2013-01-04','B':'C']

                   B         C
2013-01-03 -1.128042 -0.507726
2013-01-04  0.950293 -0.004287

In [54]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [55]:
df

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-04 -0.728997  0.950293 -0.004287  0.624739
2013-01-05 -0.655220 -0.328018  0.004137  1.078173
2013-01-06 -0.575533 -1.402827 -0.060562 -0.557574

In [59]:
df.iloc[1:3,2:4]

                   C        D
2013-01-02  0.003403 -0.35261
2013-01-03 -0.507726  0.23429

In [60]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.414492  0.003403
2013-01-03 -1.613425 -0.507726
2013-01-05 -0.655220  0.004137

In [62]:
# df[조건]

In [63]:
df[df['A']>0]

                   A         B         C        D
2013-01-02  0.414492  0.355051  0.003403 -0.35261

In [64]:
df['A']>0

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04    False
2013-01-05    False
2013-01-06    False
Freq: D, Name: A, dtype: bool

In [65]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.254055       NaN       NaN
2013-01-02  0.414492  0.355051  0.003403       NaN
2013-01-03       NaN       NaN       NaN  0.234290
2013-01-04       NaN  0.950293       NaN  0.624739
2013-01-05       NaN       NaN  0.004137  1.078173
2013-01-06       NaN       NaN       NaN       NaN

In [67]:
df2 = df.copy()

In [68]:
df3 = df.iloc[:,0]

In [69]:
df2["E"]=["one", "one", "two", "three", "four", "three"]

In [70]:
df2

                   A         B         C         D      E
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889    one
2013-01-02  0.414492  0.355051  0.003403 -0.352610    one
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290    two
2013-01-04 -0.728997  0.950293 -0.004287  0.624739  three
2013-01-05 -0.655220 -0.328018  0.004137  1.078173   four
2013-01-06 -0.575533 -1.402827 -0.060562 -0.557574  three

In [71]:
df

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-04 -0.728997  0.950293 -0.004287  0.624739
2013-01-05 -0.655220 -0.328018  0.004137  1.078173
2013-01-06 -0.575533 -1.402827 -0.060562 -0.557574

In [74]:
df2[df2["E"].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290   two
2013-01-05 -0.655220 -0.328018  0.004137  1.078173  four

In [75]:
df

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-04 -0.728997  0.950293 -0.004287  0.624739
2013-01-05 -0.655220 -0.328018  0.004137  1.078173
2013-01-06 -0.575533 -1.402827 -0.060562 -0.557574

In [76]:
df1 = df.reindex(index=dates[0:4],
                 columns=list(df.columns)+["E"])

In [77]:
df1

                   A         B         C         D   E
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889 NaN
2013-01-02  0.414492  0.355051  0.003403 -0.352610 NaN
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290 NaN
2013-01-04 -0.728997  0.950293 -0.004287  0.624739 NaN

In [78]:
df1.loc[dates[0]:dates[1],'E']=1

In [79]:
df1

                   A         B         C         D    E
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889  1.0
2013-01-02  0.414492  0.355051  0.003403 -0.352610  1.0
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290  NaN
2013-01-04 -0.728997  0.950293 -0.004287  0.624739  NaN

In [80]:
df4 = df1.copy()

In [81]:
df4.dropna(how='all', axis=0)

                   A         B         C         D    E
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889  1.0
2013-01-02  0.414492  0.355051  0.003403 -0.352610  1.0
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290  NaN
2013-01-04 -0.728997  0.950293 -0.004287  0.624739  NaN

In [82]:
df4.dropna(how='any', axis=0)

                   A         B         C         D    E
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889  1.0
2013-01-02  0.414492  0.355051  0.003403 -0.352610  1.0

In [83]:
df4 = df1.copy()

In [84]:
df4.dropna(how='any', axis=1)

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-04 -0.728997  0.950293 -0.004287  0.624739

In [85]:
df1 = df.reindex(index=dates[0:4],
                 columns=list(df.columns)+["E"])
df1

                   A         B         C         D   E
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889 NaN
2013-01-02  0.414492  0.355051  0.003403 -0.352610 NaN
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290 NaN
2013-01-04 -0.728997  0.950293 -0.004287  0.624739 NaN

In [88]:
df1.dropna(how='all', axis=1)

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-04 -0.728997  0.950293 -0.004287  0.624739

In [89]:
df1 = df.reindex(index=dates[0:4],
                 columns=list(df.columns)+["E"])
df1.loc[dates[0]:dates[1],'E']=1
df1

                   A         B         C         D    E
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889  1.0
2013-01-02  0.414492  0.355051  0.003403 -0.352610  1.0
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290  NaN
2013-01-04 -0.728997  0.950293 -0.004287  0.624739  NaN

In [91]:
df1['E'].mean()

1.0

In [92]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889  1.0
2013-01-02  0.414492  0.355051  0.003403 -0.352610  1.0
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290  1.0
2013-01-04 -0.728997  0.950293 -0.004287  0.624739  1.0

In [94]:
df1 = df.reindex(index=dates[0:4],
                 columns=list(df.columns)+["E"])
df1.loc[dates[0]:dates[1],'E']=1
df1.loc[dates[0], 'A']=np.nan
df1.loc[dates[1], 'B']=np.nan
df1.loc[dates[3], 'C']=np.nan
df1.loc[dates[1], 'D']=np.nan
df1

                   A         B         C         D    E
2013-01-01       NaN  0.254055 -1.466987 -0.127889  1.0
2013-01-02  0.414492       NaN  0.003403       NaN  1.0
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290  NaN
2013-01-04 -0.728997  0.950293       NaN  0.624739  NaN

In [95]:
df1.mean()

A   -0.642643
B    0.025435
C   -0.657103
D    0.243713
E    1.000000
dtype: float64

In [96]:
df1.fillna(df1.mean())

                   A         B         C         D    E
2013-01-01 -0.642643  0.254055 -1.466987 -0.127889  1.0
2013-01-02  0.414492  0.025435  0.003403  0.243713  1.0
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290  1.0
2013-01-04 -0.728997  0.950293 -0.657103  0.624739  1.0

In [97]:
pd.isna(df1)

                A      B      C      D      E
2013-01-01   True  False  False  False  False
2013-01-02  False   True  False   True  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False   True  False   True

In [99]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 4 entries, 2013-01-01 to 2013-01-04
Freq: D
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       3 non-null      float64
 2   C       3 non-null      float64
 3   D       3 non-null      float64
 4   E       2 non-null      float64
dtypes: float64(5)
memory usage: 364.0 bytes

In [100]:
df1.isna()

                A      B      C      D      E
2013-01-01   True  False  False  False  False
2013-01-02  False   True  False   True  False
2013-01-03  False  False  False  False   True
2013-01-04  False  False   True  False   True

In [101]:
df1.isna().sum()

A    1
B    1
C    1
D    1
E    2
dtype: int64

In [102]:
df1.isna().sum().sum()

6

In [103]:
df1.count()

A    3
B    3
C    3
D    3
E    2
dtype: int64

In [106]:
df1.isna().sum()/df1.shape[0]*100

A    25.0
B    25.0
C    25.0
D    25.0
E    50.0
dtype: float64

In [107]:
df

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-04 -0.728997  0.950293 -0.004287  0.624739
2013-01-05 -0.655220 -0.328018  0.004137  1.078173
2013-01-06 -0.575533 -1.402827 -0.060562 -0.557574

In [108]:
df.mean()

A   -0.537663
B   -0.216581
C   -0.338670
D    0.149855
dtype: float64

In [110]:
df.mean(1)

2013-01-01   -0.352029
2013-01-02    0.105084
2013-01-03   -0.753726
2013-01-04    0.210437
2013-01-05    0.024768
2013-01-06   -0.649124
Freq: D, dtype: float64

In [111]:
df.std()

A    0.683662
B    0.912164
C    0.587429
D    0.620401
dtype: float64

In [112]:
df.var()

A    0.467394
B    0.832043
C    0.345073
D    0.384897
dtype: float64

In [113]:
df.max()

A    0.414492
B    0.950293
C    0.004137
D    1.078173
dtype: float64

In [114]:
df.min()

A   -1.613425
B   -1.402827
C   -1.466987
D   -0.557574
dtype: float64

In [115]:
df.median()

A   -0.615377
B   -0.036982
C   -0.032424
D    0.053200
dtype: float64

In [116]:
df

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.414492  0.355051  0.003403 -0.352610
2013-01-03 -1.613425 -1.128042 -0.507726  0.234290
2013-01-04 -0.728997  0.950293 -0.004287  0.624739
2013-01-05 -0.655220 -0.328018  0.004137  1.078173
2013-01-06 -0.575533 -1.402827 -0.060562 -0.557574

In [117]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01 -0.067297  0.254055 -1.466987 -0.127889
2013-01-02  0.347195  0.609107 -1.463584 -0.480499
2013-01-03 -1.266230 -0.518935 -1.971310 -0.246209
2013-01-04 -1.995227  0.431358 -1.975597  0.378530
2013-01-05 -2.650447  0.103339 -1.971460  1.456703
2013-01-06 -3.225980 -1.299488 -2.032022  0.899129

In [118]:
def dataa(x):
    return x.max()-x.min()

df.apply(dataa)

A    2.027917
B    2.353120
C    1.471123
D    1.635746
dtype: float64

In [119]:
df.apply(lambda x: x.max()-x.min())

A    2.027917
B    2.353120
C    1.471123
D    1.635746
dtype: float64

In [120]:
gender = pd.Series(["남자","여자","여자","여자","남","male"])

In [121]:
gender.value_counts()

여자      3
남자      1
남       1
male    1
dtype: int64

In [122]:
gender.replace("남", "남자")  # 원본 수정안함

0      남자
1      여자
2      여자
3      여자
4      남자
5    male
dtype: object

In [123]:
gender.replace(["남", "male"], ["남자", "남자"])

0    남자
1    여자
2    여자
3    여자
4    남자
5    남자
dtype: object

In [124]:
gender.str.replace("남", "남자")

0     남자자
1      여자
2      여자
3      여자
4      남자
5    male
dtype: object

In [126]:
df = pd.DataFrame(np.random.randn(10,4))

In [127]:
df

          0         1         2         3
0 -1.465298  0.952371 -0.522609 -0.246863
1  0.111090  0.358994  0.825975 -0.711925
2 -0.362592  1.594530  0.957934  0.530152
3  0.570069 -0.687586  0.447397 -1.746591
4  1.704626  0.260948 -0.769105 -1.222303
5 -0.143497 -0.482389  0.100466 -0.322098
6 -0.654953 -1.524038 -0.048702  0.566150
7 -0.654741 -0.650679 -0.306109 -0.006121
8 -1.515564 -0.118782  1.152962  0.553918
9  0.384622  0.720856  0.169358 -0.521551

In [128]:
pieces = [df[:3],df[3:7],df[7:]]

In [129]:
pieces

[          0         1         2         3
 0 -1.465298  0.952371 -0.522609 -0.246863
 1  0.111090  0.358994  0.825975 -0.711925
 2 -0.362592  1.594530  0.957934  0.530152,
           0         1         2         3
 3  0.570069 -0.687586  0.447397 -1.746591
 4  1.704626  0.260948 -0.769105 -1.222303
 5 -0.143497 -0.482389  0.100466 -0.322098
 6 -0.654953 -1.524038 -0.048702  0.566150,
           0         1         2         3
 7 -0.654741 -0.650679 -0.306109 -0.006121
 8 -1.515564 -0.118782  1.152962  0.553918
 9  0.384622  0.720856  0.169358 -0.521551]

In [130]:
pieces[0]

          0         1         2         3
0 -1.465298  0.952371 -0.522609 -0.246863
1  0.111090  0.358994  0.825975 -0.711925
2 -0.362592  1.594530  0.957934  0.530152

In [131]:
pieces[1]

          0         1         2         3
3  0.570069 -0.687586  0.447397 -1.746591
4  1.704626  0.260948 -0.769105 -1.222303
5 -0.143497 -0.482389  0.100466 -0.322098
6 -0.654953 -1.524038 -0.048702  0.566150

In [132]:
pieces[2]

          0         1         2         3
7 -0.654741 -0.650679 -0.306109 -0.006121
8 -1.515564 -0.118782  1.152962  0.553918
9  0.384622  0.720856  0.169358 -0.521551

In [136]:
pd.concat([pieces[0],pieces[1],pieces[2]], axis=1, join='inner')

Empty DataFrame
Columns: [0, 1, 2, 3, 0, 1, 2, 3, 0, 1, 2, 3]
Index: []

In [137]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [138]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [139]:
left

   key  lval
0  foo     1
1  foo     2

In [140]:
right

   key  rval
0  foo     4
1  foo     5

In [141]:
pd.merge(left,right,on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [142]:
pd.merge(left,right,left_on="key", right_on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [143]:
left.set_index('key',inplace=True)
right.set_index('key',inplace=True)

In [144]:
left.join(right,on="key")

     lval  rval
key
foo     1     4
foo     1     5
foo     2     4
foo     2     5

In [145]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

In [146]:
df

     A      B         C         D
0  foo    one  0.428007  1.323123
1  bar    one -0.370750 -1.283336
2  foo    two -0.050486  2.533118
3  bar  three  0.401742 -0.542269
4  foo    two -0.098337  0.710987
5  bar    two -1.359441 -0.946927
6  foo    one -0.829947 -1.387860
7  foo  three -0.011084 -0.069193

In [147]:
df.sum()

A        foobarfoobarfoobarfoofoo
B    oneonetwothreetwotwoonethree
C                       -1.890296
D                        0.337641
dtype: object

In [148]:
df.groupby("A")

In [149]:
df.groupby("A").sum()

            C         D
A
bar -1.328449 -2.772532
foo -0.561847  3.110173

In [155]:
test = df.groupby(["A","B"]).sum()

In [156]:
test

                  C         D
A   B
bar one   -0.370750 -1.283336
    three  0.401742 -0.542269
    two   -1.359441 -0.946927
foo one   -0.401939 -0.064738
    three -0.011084 -0.069193
    two   -0.148824  3.244104

In [157]:
test.stack()

A    B
bar  one    C   -0.370750
            D   -1.283336
     three  C    0.401742
            D   -0.542269
     two    C   -1.359441
            D   -0.946927
foo  one    C   -0.401939
            D   -0.064738
     three  C   -0.011084
            D   -0.069193
     two    C   -0.148824
            D    3.244104
dtype: float64

In [158]:
test.stack().unstack()

                  C         D
A   B
bar one   -0.370750 -1.283336
    three  0.401742 -0.542269
    two   -1.359441 -0.946927
foo one   -0.401939 -0.064738
    three -0.011084 -0.069193
    two   -0.148824  3.244104

In [160]:
test1 = test.stack()
test1.unstack()

                  C         D
A   B
bar one   -0.370750 -1.283336
    three  0.401742 -0.542269
    two   -1.359441 -0.946927
foo one   -0.401939 -0.064738
    three -0.011084 -0.069193
    two   -0.148824  3.244104

In [159]:
test1 = test.stack()
test1.unstack(0)

A             bar       foo
B
one   C -0.370750 -0.401939
      D -1.283336 -0.064738
three C  0.401742 -0.011084
      D -0.542269 -0.069193
two   C -1.359441 -0.148824
      D -0.946927  3.244104

In [161]:
test1.unstack(1)

B           one     three       two
A
bar C -0.370750  0.401742 -1.359441
    D -1.283336 -0.542269 -0.946927
foo C -0.401939 -0.011084 -0.148824
    D -0.064738 -0.069193  3.244104

In [162]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)

In [163]:
df

        A  B    C         D         E
0     one  A  foo -1.061153  0.309950
1     one  B  foo -0.549705  1.816501
2     two  C  foo -1.206376  0.838326
3   three  A  bar  0.576402 -0.573775
4     one  B  bar  0.459230  2.422263
5     one  C  bar  1.644956 -0.328609
6     two  A  foo  0.581785 -1.036437
7   three  B  foo -0.587236 -1.047806
8     one  C  foo  0.339025 -1.767589
9     one  A  bar -0.111143 -0.091863
10    two  B  bar -1.425469 -0.509958
11  three  C  bar  0.261443  1.822479

In [167]:
test = pd.pivot_table(df,values="D",index=["A","B"],columns=["C"],aggfunc="sum")

In [168]:
test

C             bar       foo
A     B
one   A -0.111143 -1.061153
      B  0.459230 -0.549705
      C  1.644956  0.339025
three A  0.576402       NaN
      B       NaN -0.587236
      C  0.261443       NaN
two   A       NaN  0.581785
      B -1.425469       NaN
      C       NaN -1.206376

In [170]:
test.head(3)

C           bar       foo
A   B
one A -0.111143 -1.061153
    B  0.459230 -0.549705
    C  1.644956  0.339025

In [174]:
test.reset_index(inplace=True)

In [176]:
test.head(2)

C  index    A  B       bar       foo
0      0  one  A -0.111143 -1.061153
1      1  one  B  0.459230 -0.549705

In [177]:
test.melt(id_vars=['A','B'])

        A  B      C     value
0     one  A  index  0.000000
1     one  B  index  1.000000
2     one  C  index  2.000000
3   three  A  index  3.000000
4   three  B  index  4.000000
5   three  C  index  5.000000
6     two  A  index  6.000000
7     two  B  index  7.000000
8     two  C  index  8.000000
9     one  A    bar -0.111143
10    one  B    bar  0.459230
11    one  C    bar  1.644956
12  three  A    bar  0.576402
13  three  B    bar       NaN
14  three  C    bar  0.261443
15    two  A    bar       NaN
16    two  B    bar -1.425469
17    two  C    bar       NaN
18    one  A    foo -1.061153
19    one  B    foo -0.549705
20    one  C    foo  0.339025
21  three  A    foo       NaN
22  three  B    foo -0.587236
23  three  C    foo       NaN
24    two  A    foo  0.581785
25    two  B    foo       NaN
26    two  C    foo -1.206376

In [180]:
data = pd.read_csv('전라북도_소방서별 소방자동차 현황_20170810..csv', encoding='cp949')
data.head(2)

,시군,고가차 53(m),고가차 52(m),고가차 46(m),굴 절차 36(m),굴 절차 28(m),굴 절차 27(m),배 연 차,구 급 차,구조차 버스,...,굴 삭 기,"트레일러 공기,양수",트레일러 보트,이동정비차,이동체험차,장비운반차,이동중계차,산불진화차,유 조 차,버 스
0,본부,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,1,1.0,NaN,1.0,2.0
1,덕진,1.0,NaN,NaN,NaN,NaN,1.0,NaN,10.0,1.0,...,NaN,1.0,1.0,NaN,NaN,1,NaN,1.0,NaN,NaN

In [181]:
data.melt(id_vars="시군")

      시군   variable  value
0     본부  고가차 53(m)    NaN
1     덕진  고가차 53(m)    1.0
2     완산  고가차 53(m)    NaN
3     군산  고가차 53(m)    NaN
4     익산  고가차 53(m)    1.0
..   ...        ...    ...
369   남원      버   스    NaN
370   김제      버   스    NaN
371   고창      버   스    NaN
372   부안      버   스    NaN
373  무진장      버   스    NaN

[374 rows x 3 columns]